#3. Напишите программу, в которой пользователь будет задавать две строки, 
# а программа - определять количество вхождений одной строки в другой.

a=input('введите 1 строку: ')
b=input('введите 2 строку: ')
print(a.count(b))
print(b.count(a))